{
    "1MY5ibIq6Uq6Jk6SPFlyyvMZRcfpGCBJm": {
      "title": "Temperature Range on Thermoelectric Generator Voltage Output",
      "authors": "Chaela Jia-li D. Corpuz, Michael R. Magpantay, Jheda Mae P. Cruz, Kirsten Marichella V. Adofina, Shamel L. Javier",
      "abstract": "The purpose of this experiment was to assess whether there existed any relationship between temperature gradients and voltage output in a self-made thermoelectric generator (TEG) setup. With a goal of inducing controlled temperature gradients (10-75°C) using controlled temperature devices: Heat coil and Peltier cooler, technical limitations because of cost-cutting material and inadequate thermal control resulted in unstable temperatures with oscillations, rendering data collection impossible. No data indicating correlation between voltage and temperature were capable of being collected. It is found that high-grade cooling, superior materials, and tight control of the flow rate are an urgent necessity in TEG research. Improved work has to investigate new and innovative cooling technologies and well-controlled test facilities.",
      "keywords": "thermoelectricity, thermoelectric generator, renewable energy production.",
      "section": "STEM 2",
      "featured": true
    },
  "1sMo6-VbKIjpPfyje8WLxLpvWSpXvQzz5": {
    "title": "Hexagonal Hollow Blocks",
    "authors": "Rayven M. Luib, Vince Jino B. Baltazar, Vince Anthonie P. Caadan, Francis Rodwen R. Isorena, Mark Rocher M. Ambrocio",
    "abstract": "The need for stronger and more durable alternative hollow block designs has risen as a result of unexpected earthquakes that have caused infrastructure to collapse due to flimsy building components. This research project intended to create a hexagonal hollow block molder (HBM) and assess the performance of the resulting hexagonal hollow blocks (HexCHBs) compared to traditional rectangular hollow blocks (CHBs). Additionally, quantitative-experimental research design was utilized to test the hypothesis that HexCHBs would show superior performance in terms of structural durability and water absorption. The Hexablock Molder was successfully constructed using AutoCAD 3D modeling, and HexCHBs were made using a mixture of water, cement powder, and sand. The tests results showed that HexCHBs had significantly higher structural durability compared to CHBs, while the water absorption rate remained within acceptable ranges but lower than the standard according to ASTM standards. These findings suggest that the innovative hexagonal design, incorporating interlocking mechanisms and strategically placed hollow cores, offers a promising alternative to traditional hollow blocks for enhancing structural integrity in construction. Further research is recommended to optimize the mixture for enhanced durability and explore the potential for making HexCHBs the standard hollow block in construction.",
    "keywords": "hexagonal hollow block, hexagonal hollow block molder, interlocking mechanisms, alternative to traditional hollow block, structural integrity",
    "section": "STEM 2"
  },
  "1JKt3E47QJH_fSnejojLyO42XUfEJHTpd": {
    "title": "Solar-powered Mist-emitting Cooling Post — SPMECP",
    "authors": "Izzabel M. Cabusay, Axcelle Jade C. Ecleo, Kyleigh Zabrina S. Calimlim, Nathalie Jeiane G. Virrey, Hannah Grace B. Gonzaga",
    "abstract": "As cities become hotter mainly because of climate change and urban development, effective ways of managing surface temperature are very useful. This paper focuses on a misting system known as the Solar-Powered Mist-Emitting Cooling Post which utilizes solar energy to provide power to the cooling system. The device works automatically, it operates on time and temperature basis and is switched on when required, making it convenient to use and conservationist. In order to verify the efficiency of our system, we conducted the experiment under various climate conditions. The performance was most effective in nice weather, where it sustained the cool zone for more than thirteen and a half minutes (13 1/2). But as soon as the temperature rises, the cooling aspect was not as efficient as the producers had intended it to be clocking close to 2 minutes at most. It was found that the cooling effect became optimal in about 3 minutes after the system was set on. To test how well the cooling post could manage with higher temperatures, the experiment was conducted in the afternoon, a time when there is usually high heat and the result was impressive. From our project, it will be clear how cooling technology based on solar power can help mitigate the temperature increase in cities. In the future, we could still improve the ways in which we made the system stronger and more applicable to larger spaces.",
    "keywords": "cooling post, mist, cooling system, solar powered",
    "section": "STEM 2"
  },
  "1JKt3E47QJH_fSnejojLyO42XUfEJHTpd": {
    "title": "Solar-powered Mist-emitting Cooling Post — SPMECP",
    "authors": "Izzabel M. Cabusay, Axcelle Jade C. Ecleo, Kyleigh Zabrina S. Calimlim, Nathalie Jeiane G. Virrey, Hannah Grace B. Gonzaga",
    "abstract": "",
    "keywords": "",
    "section": "STEM 2"
  },
  "1JKt3E47QJH_fSnejojLyO42XUfEJHTpd": {
    "title": "Solar-powered Mist-emitting Cooling Post — SPMECP",
    "authors": "Izzabel M. Cabusay, Axcelle Jade C. Ecleo, Kyleigh Zabrina S. Calimlim, Nathalie Jeiane G. Virrey, Hannah Grace B. Gonzaga",
    "abstract": "",
    "keywords": "",
    "section": "STEM 2"
  },
  "1JKt3E47QJH_fSnejojLyO42XUfEJHTpd": {
    "title": "Solar-powered Mist-emitting Cooling Post — SPMECP",
    "authors": "Izzabel M. Cabusay, Axcelle Jade C. Ecleo, Kyleigh Zabrina S. Calimlim, Nathalie Jeiane G. Virrey, Hannah Grace B. Gonzaga",
    "abstract": "",
    "keywords": "",
    "section": "STEM 2"
  },
  "1JKt3E47QJH_fSnejojLyO42XUfEJHTpd": {
    "title": "Solar-powered Mist-emitting Cooling Post — SPMECP",
    "authors": "Izzabel M. Cabusay, Axcelle Jade C. Ecleo, Kyleigh Zabrina S. Calimlim, Nathalie Jeiane G. Virrey, Hannah Grace B. Gonzaga",
    "abstract": "",
    "keywords": "",
    "section": "STEM 2"
  }
}