{
    "1MY5ibIq6Uq6Jk6SPFlyyvMZRcfpGCBJm": {
      "title": "Temperature Range on Thermoelectric Generator Voltage Output",
      "authors": "Chaela Jia-li D. Corpuz, Michael R. Magpantay, Jheda Mae P. Cruz, Kirsten Marichella V. Adofina, Shamel L. Javier",
      "abstract": "The purpose of this experiment was to assess whether there existed any relationship between temperature gradients and voltage output in a self-made thermoelectric generator (TEG) setup. With a goal of inducing controlled temperature gradients (10-75°C) using controlled temperature devices: Heat coil and Peltier cooler, technical limitations because of cost-cutting material and inadequate thermal control resulted in unstable temperatures with oscillations, rendering data collection impossible. No data indicating correlation between voltage and temperature were capable of being collected. It is found that high-grade cooling, superior materials, and tight control of the flow rate are an urgent necessity in TEG research. Improved work has to investigate new and innovative cooling technologies and well-controlled test facilities.",
      "keywords": "thermoelectricity, thermoelectric generator, renewable energy production.",
      "section": "STEM 2"
    },
  "1sMo6-VbKIjpPfyje8WLxLpvWSpXvQzz5": {
    "title": "Hexagonal Hollow Blocks",
    "authors": "Rayven M. Luib, Vince Jino B. Baltazar, Vince Anthonie P. Caadan, Francis Rodwen R. Isorena, Mark Rocher M. Ambrocio",
    "abstract": "The need for stronger and more durable alternative hollow block designs has risen as a result of unexpected earthquakes that have caused infrastructure to collapse due to flimsy building components. This research project intended to create a hexagonal hollow block molder (HBM) and assess the performance of the resulting hexagonal hollow blocks (HexCHBs) compared to traditional rectangular hollow blocks (CHBs). Additionally, quantitative-experimental research design was utilized to test the hypothesis that HexCHBs would show superior performance in terms of structural durability and water absorption. The Hexablock Molder was successfully constructed using AutoCAD 3D modeling, and HexCHBs were made using a mixture of water, cement powder, and sand. The tests results showed that HexCHBs had significantly higher structural durability compared to CHBs, while the water absorption rate remained within acceptable ranges but lower than the standard according to ASTM standards. These findings suggest that the innovative hexagonal design, incorporating interlocking mechanisms and strategically placed hollow cores, offers a promising alternative to traditional hollow blocks for enhancing structural integrity in construction. Further research is recommended to optimize the mixture for enhanced durability and explore the potential for making HexCHBs the standard hollow block in construction.",
    "keywords": "hexagonal hollow block, hexagonal hollow block molder, interlocking mechanisms, alternative to traditional hollow block, structural integrity",
    "section": "STEM 2"
  },
  "1JKt3E47QJH_fSnejojLyO42XUfEJHTpd": {
    "title": "Solar-powered Mist-emitting Cooling Post — SPMECP",
    "authors": "Izzabel M. Cabusay, Axcelle Jade C. Ecleo, Kyleigh Zabrina S. Calimlim, Nathalie Jeiane G. Virrey, Hannah Grace B. Gonzaga",
    "abstract": "As cities become hotter mainly because of climate change and urban development, effective ways of managing surface temperature are very useful. This paper focuses on a misting system known as the Solar-Powered Mist-Emitting Cooling Post which utilizes solar energy to provide power to the cooling system. The device works automatically, it operates on time and temperature basis and is switched on when required, making it convenient to use and conservationist. In order to verify the efficiency of our system, we conducted the experiment under various climate conditions. The performance was most effective in nice weather, where it sustained the cool zone for more than thirteen and a half minutes (13 1/2). But as soon as the temperature rises, the cooling aspect was not as efficient as the producers had intended it to be clocking close to 2 minutes at most. It was found that the cooling effect became optimal in about 3 minutes after the system was set on. To test how well the cooling post could manage with higher temperatures, the experiment was conducted in the afternoon, a time when there is usually high heat and the result was impressive. From our project, it will be clear how cooling technology based on solar power can help mitigate the temperature increase in cities. In the future, we could still improve the ways in which we made the system stronger and more applicable to larger spaces.",
    "keywords": "cooling post, mist, cooling system, solar powered",
    "section": "STEM 2"
  },
  "19dTtqGA_xgJ42-3832OwDIzGtHG8Ztlq": {
    "title": "Development of Piezoelectric Energy Harvester Road Humps for Street Lamps",
    "authors": "Anne Zaira M. Villas, Ma. Rochelle C. Realeza, Sean Marione M. Pablo, Irish R. Delas Alas, Lance Weyron V. Durante, Marion Josaint Alvarez",
    "abstract": "The search for alternative renewable energy sources has become increasingly crucial as global energy demands rise and the environmental impact of fossil fuels becomes more evident. This study investigated the energy harvesting potential of a piezoelectric road hump using different vehicle types. The road hump was designed with mechanical and electrical features to efficiently convert pressure into electricity. Testing involved measuring voltage, current, and power generated by a bicycle, a three-wheeled electric bike, and a motorcycle at two contact points on the hump. Results showed that the three-wheeled electric bike generated the highest average voltage and power, while the bicycle produced the lowest. The motorcycle yielded mid-range values. Contact point 2 consistently produced higher voltage, current, and power than contact point 1 for all vehicles. ANOVA analysis revealed a significant difference in voltage generated among the vehicles at both contact points, but no significant difference in current or power. These findings suggest that vehicle type significantly affects voltage output, while the impact on current and power is less pronounced. However, the low current output of piezoelectric road humps prevented accurate measurements of energy efficiency and limited their ability to power street lamps. Piezoelectric sensors generate high voltage output with relatively low current. Overall, piezoelectric energy harvesting from road humps shows potential for addressing energy demands sustainably.",
    "keywords": "piezoelectric energy harvesting, road humps, street lighting, power generation, piezoelectric materials.",
    "section": "STEM 1"
  },
  "1xIWJOH9TSIKDfXQe9V9Ef1uVw5f5v3tW": {
    "title": "Algae Biodiesel Converter and Distillation - ABCD Machine and Applications",
    "authors": "Darryll Ace A. Masacupan, Ryan M. Echiverri, Beatrice C. Reyes, Franchesca I. Ilao, Arbin Jr. C. Sarmiento, Gwen Stefanie D. San Jose",
    "abstract": "The need for renewable energy sources has grown urgent due to the environmental consequences of fossil fuel dependency. This study addresses this need by developing the Algae Biodiesel Converter and Distillation (ABCD) Machine, a prototype designed to convert algae into biodiesel. Algae were selected for their high lipid content, rapid growth, and adaptability to various environments, including wastewater, making them a promising resource for biodiesel production. Additionally, this research employed a quantitative-experimental approach to evaluate the machine's capability to process algae into biodiesel through compartments such as algae strainer, water drainage, chemical storage, mixer, boiling and distillation processor Tests revealed the machine's ability to produce biodiesel efficiently, with consistent yields and significant energy outputs that corresponds to changing energy by denatured alcohol content. Challenges such as ensuring structural stability and refining chemical ratios were identified; however, even with this, the machine demonstrated potential for practical and scalable biodiesel production. The findings validate algae-based biodiesel as a viable alternative energy source, offering a cleaner, renewable solution to global energy demands wherein further research is recommended to enhance the machine's design, improve process efficiency, and explore broader applications for algae biodiesel.",
    "keywords": "algae biodiesel, ABCD machine, renewable energy, sustainable fuel, distillation, combustion.",
    "section": "STEM 1",
    "featured": true
  },
  "1bx1M8wtDQM2YOvxgjTe_43-xb_W07-Xk": {
    "title": "Bio-Pencil Using Rice (Oryza Sativa) Hull",
    "authors": "Presco Jr. M. Etolle, Lianne V. Maldia, Anne Revsen M. Coronado, Paul Harris DJ. Serrano, Lara Kate Ashly C. Arce, Richiand Andrei F. Valmonte",
    "abstract": "The study of rice hull-based bio-pencils presents an innovative solution to the growing demand for sustainable products. By utilizing rice hulls, an abundant agricultural byproduct, as a primary component in pencil production, this approach addresses both waste management and environmental concerns. The composition of these bio-pencils, incorporating 48% ground rice hulls, 38% wood glue, and 14% water, provides a viable alternative to traditional wood-based pencils, which contribute to deforestation. Additionally, carbonized rice hulls combined with clay offer a promising substitute for graphite cores, reducing the need for environmentally damaging mining activities. The research highlights the potential of rice hulls to meet the functional requirements of conventional pencils while significantly minimizing environmental impact. Despite achieving satisfactory hardness levels, further refinement in production techniques and material analysis is recommended to enhance the bio-pencil's performance and sustainability. Overall, this innovation not only promotes eco-conscious consumer behavior but also supports sustainable production practices.",
    "keywords": "Rice hulls, Bio-pencils, Biodegradable binders, Artificial graphite, Eco-friendly",
    "section": "STEM 1"
  },
  "1GewvVsYBT1mkLykdbWA-YkDo1oYTxah-": {
    "title": "Noise-Harvesting System Device for Electrical Output",
    "authors": "Charles Adrielle A. Mero, John Viernuel G. Nachon, Samantha Sherine E. Cadiente, Mary Jane C. Espinar, Lyzabeth D. Dimafelis, Szascke Kenji P. Flores",
    "abstract": "Noise pollution, ranked by the World Health Organization as the third most hazardous form of pollution after air and water, poses significant risks to public health, including hearing loss, behavioral changes, and cardiovascular issues, especially in urban and industrial areas. This study explores innovative solutions to address noise pollution alleviating global energy shortages by converting noise into electricity. Piezoelectric transducers, resonance-based energy harvesters, and piezoelectric materials are subjected to analysis and discussion in converting acoustic energy into useful power. Due to their relatively high efficiency for noisy environments, piezoelectric materials tend to produce considerable electrical output toward powering small devices or sensors. When tuned to their specific noise sources-for example, those from traffic, railroads and other machinery-well-designed resonant technologies optimize energy harvesting opportunities. This technology has its basis in the piezoelectric effect, converting sound stress into electrical energy. Optimizing material properties and device design is critical for maximizing energy conversion efficiency. Combining these technologies with renewable energy systems has the dual benefit of reducing noise pollution while providing alternative, sustainable energy sources. This strategy addresses critical public health concerns while promoting energy sustainability, particularly in the urbanized and developing regions.",
    "keywords": "noise pollution, energy harvesting, piezoelectric transducers",
    "section": "STEM 1"
  },
  "18MaVDLQcjVsP7w0k6LPrG6cXRCloHUiF": {
    "title": "Semi-Automatic Shoe Rack Deodorizer",
    "authors": "Ma. Lorraine C. Leopando, Kris Althea M. Salazar, Noah Kurt Marthe E. Azares, Luis Cedrix R. Ganibo, Rogie F. Maray",
    "abstract": "The prevalence of unpleasant shoe odors poses a significant hygiene challenge, particularly in humid environments like the Philippines. This study explores the development of a semi-automatic shoe rack deodorizer designed to mitigate these odors. Utilizing a quantitative-experimental research design, the researchers constructed a prototype incorporating a deodorizing mechanism powered by a microcontroller and gas sensor. The study assessed the deodorizer's effectiveness by measuring the reduction of odor levels in parts per million (PPM) over varying time intervals (5, 7, and 10 minutes). The study found that the deodorizer's performance was inconsistent and did not effectively reduce odor levels as anticipated. The average ppm reduction increased instead of decreased across all time parameters, suggesting potential issues with the system's operation or design. The study concludes with recommendations for future development, including sensor calibration, IoT integration, and exploring alternative sanitizing methods. This research contributes to the ongoing development of innovative and practical solutions for shoe storage and hygiene.",
    "keywords": "shoe rack deodorizer, semi-automatic deodorizer, deodorizing mechanism, shoe odor",
    "section": "STEM 2"
  },
  "17SYLPkZ4CqRG5VZDwMnNyr86s9SdOcLx": {
    "title": "Roof Cooling System Using Greywater",
    "authors": "Will Glenford F. Abary, Levienia M. Lara, John Dominic Erik E. Montes, Kevin M. Pabines, Ma. Divine C. Velasco",
    "abstract": "The study about the cooling system is a highly trending topic for students, particularly during summer seasons. However, as per this study, the researchers explore the possibility of developing a roof cooling system with the utilization of greywater. This study aims to assess the performance of the roof cooling system using greywater in determining if it significantly affects the roof temperature, water usage, or cooling duration relative to no system in place. To do this, 1 parameter will be used to assess the performance of the roof cooling system. A quantitative-experimental research design was utilized intending to develop a roof cooling system using greywater. The researchers' conducted the study at one of the houses of the researchers for 2 weeks to gather all the data needed. Based on the results, day 1 and day 5 have significance because their p-values are less than 0.05. While the other days' time points are not similar, which means it may affect the relevance of the result. When it is violated, the F-value and p-value may not be accurate. Since there are many errors in the statistical data, the researchers could not tell whether the utilization of the roof cooling system is significant or not. However, the other 2 parameters provide stable and consistent statistical data, specifically the water usage. Furthermore, the researchers recommend using this cooling system during summer to get reliable data from a small and non-ventilated house with an availability of greywater at least 2 days in 1 week.",
    "keywords": "Roof cooling system, greywater, water usage, temperature dropped",
    "section": "STEM 2"
  },
  "1TZyzEUMm6LAxOsyGtsmiair9CMinljOv": {
    "title": "Multifunctional Handy Fish Tool",
    "authors": "Jelly T. Laco, Sean D. Requimin, Zyryll D. Aliparo, Ryan S. Leopando, Nichole Triszha D. Pascasio, Fraim Albert B. Flores",
    "abstract": "The need for a multifunctional tool that streamlines fish preparation, enhances sanitation, and reduces manual effort has long been recognized, particularly in the Philippines where fish is a primary protein source. This study explores the potential of a tool designed to aid in fish preparation by incorporating multiple features: a descaler, a scale compartment, tweezers for deboning, and two knives one for gutting and one for filleting. While existing multifunctional tools for fish preparation lack a dedicated scale compartment, this tool addresses that gap. The study aims to evaluate the functionality of the tool in terms of its maximum scale capacity, scale efficiency, and the sharpness of its knives. To assess these features, the tool was tested on various fish species, focusing on scale removal efficiency, weight capacity of the scale compartment, and the performance of the knives. Tilapia, with its medium and soft scales, was found to be the most suitable fish for the tool, as the scale compartment was filled with 65 grams of scales after processing 2 kilograms of Tilapia. The results demonstrate that the Multifunctional Handy Fish Tool has the potential to significantly improve fish preparation by making the process more efficient and sanitary. Future research could focus on refining the tool’s design and functionality to further enhance its practical applications. ",
    "keywords": "fish preparation, multifunctional, descaler, scale compartment, sharpness of blade, scale capacity, scale efficiency",
    "section": "STEM 1"
  },
  "18m5cnmwbexOEoCsPDy_bme9S3Mk-zZhT": {
    "title": "Support Smoke Filtration System For Internal Combustion Engine-Primed Farm Equipment",
    "authors": "Althea S. Agbagala, Shecaniah E. Relumen, Noel P. Carrera, Jan Tristan B. Bajarias, Aevan Enrico C. Monfero",
    "abstract": "This study examines the design and operation of a support smoke filtration system for diesel-operated farm equipment, with focus on internal combustion engine-started vehicles such as tractors and irrigation pumps. The employment of diesel engines in agriculture has been a prime cause of environmental problems due to the release of harmful contaminants, like particulate matter (PM) and nitrogen oxides (NO2). The current study is geared towards developing a double-pipe filter system comprising a catalytic filter. activated carbon, and ceramic mesh capable of effectively suppressing emissions as well as purifying the air. The filter system's efficiency in the absorption of particles and smoke and its effectiveness in enhancing equipment operating efficiency is scrutinized through a set of experimental tests. The findings indicate that the proposed filtration system effectively suppresses emissions, thereby encouraging sustainable farming and environmental compliance. The research emphasizes the importance of advanced filtration technologies in minimizing the carbon footprint of agricultural practices and encouraging sustainable agricultural practices.",
    "keywords": "Smoke Filtration System, Diesel-Powered Farm Equipment, Internal Combustion Engine, Particulate Matter (PM), Nitrogen Oxides (NO2)",
    "section": "STEM 1"
  },
  "19YHEXlv-96I9RAvQ7PhERUwzQ8-V0GcF": {
    "title": "Peanut Shells Phone Cases",
    "authors": "Raver M. Ritual, Precious Betty D. Boragay, Felmar M. Orencio, Lance Dustin E. Isleta, John Paolo M. Dalagan",
    "abstract": "The growing demand for sustainable and eco-friendly materials has inspired research into alternative solutions for everyday products. This study investigated the development of biodegradable mobile phone cases using peanut shells combined with wood glue. By exploring three composition ratios—45 grams, 90 grams, and 135 grams of wood glue with a fixed 90 grams of peanut shells—the researchers assessed the material's suitability in terms of softness and hardness. The study utilized a quantitative-experimental approach, conducting tensile strength tests, bend resistance tests, hardness test, and drop resistance tests. Findings revealed that increasing the wood glue ratio improved its suitability as mobile phone case while affecting the performance. The 90-gram composition emerged as the most suitable balance of properties, demonstrating optimal performance for creating durable and eco-friendly phone cases. These results suggest that peanut shells and wood glue offer a viable and sustainable alternative for producing peanut shells phone cases, aligning with environmental goals and functional product standards. To conclude, the development of peanut shells phone cases made from peanut shells demonstrates promising potential, contributing to reduced plastic waste and promoting eco-friendly alternatives in the mobile accessory industry.",
    "keywords": "peanut shells, wood glue, biodegradable materials, sustainable, mobile phone cases.",
    "section": "STEM 1"
  },
  "16gv1-sIIGsb0Y478q2jaR3IcO7uZAX1i": {
    "title": "Non-contact Vape Detector",
    "authors": "Lorenz Andrei B. Embile, Chester D. Lizardo, Lyde Iver M. Nanales, Jesrod Shem T. Penid, James Laurence M. Poso, Dave Ross P. Sandoval",
    "abstract": "The rising incidence of e-cigarette use, especially among adolescents, had become a significant public health concern. Traditional smoke detectors often failed to detect vaping activities effectively due to the distinct particulate size and composition of vapor compared to conventional smoke. This study aimed to develop and evaluate a non-contact vape detector utilizing a smoke sensor to identify the aerosols produced by vaping devices. The prototype was constructed using two Microbit Microcontrollers; one served as a signal and the other as an alarm, along with a smoke sensor and additional electronic components. Trial tests were conducted in closed environments to assess the detector's sensitivity and response time to various concentrations of vape aerosols. Results demonstrated that the detector could reliably identify vape-generated particulates with high sensitivity, detecting particles as small as 0.3 microns. The one-way ANOVA and supporting boxplot analysis revealed a statistically significant difference in the vape detector alarm's response time across distances of 10 cm, 30 cm, and 60 cm, suggesting consistent performance regardless of proximity within the tested range. However, this study was limited by its failure to account for environmental factors such as humidity, which can affect smoke detection. This research contributed to the development of innovative, contactless detection technologies that can aid in enforcing anti-vaping policies in schools and other restricted areas.",
    "keywords": "Vaping, Vape Detection, Smoke Sensor, Microbit Microcontroller, Alarm System.",
    "section": "STEM 2"
  },
  "1wPIbdqKYpCg1LRum__mkgqizfRmqpGUe": {
    "title": "Gimbox: An Innovative Delivery Box",
    "authors": "Maria Ellaine G. Bainto, Xyrhyz Jeanalle V. Munda, Jasper M. Macasaet, John Kervie G. Tunay, Jhona Mae C. Exconde",
    "abstract": "Big challenges for the food delivery industry are to keep food fresh, prevent spills, and be environmentally friendly while transporting. This paper presents a new food delivery box called Gimbox with special features designed to solve these problems. Gimbox utilizes a gimbal system, which is inspired by gyroscopes, to reduce food and drinks from spilling when tilted. The Gimbox is designed to be eco-friendly, using strong, reusable materials to cut down on waste from single-use packaging. It also has insulation to keep food at the right temperature, so it doesn't need to be reheated or spoil, even on long trips or in traffic.This research presents the Gimbox as an intelligent and practical development in food delivery. It is aimed at solving the delivery problems while satisfying customer requirements for safe and eco-friendly services. Analyzing its features and advantages, this research indicates how the Gimbox can create a new standard for food delivery and bring happiness to customers. Experimental results reveal that while the Gimbox is slightly more effective at maintaining cooler temperatures (28°C–30°C) compared to a Normal Box (29°C–31°C), it consistently experiences higher spillage (690 ml–900 ml) and longer delivery times (5–20 minutes more). These findings highlight the need for further refinement of the Gimbox to enhance its spillage control and efficiency. Despite these challenges, the Gimbox represents a promising step toward sustainable and practical solutions for food delivery.",
    "keywords": "Gimbox, gyroscopes, gimbal system, spillage control, eco-friendly services.",
    "section": "STEM 2"
  },
  "1j-7BQXhmptH07MD1gizP2x_cjCt_QeX0": {
    "title": "Piezoelectric Numeric Keypad Energy Generation",
    "authors": "Mark Anthony R. Balobalo, Angelo Rhaye S. Cadawas, Phaul Andrei D. Castillo, Sean Fraser I. Castro, Emmanuel C. De Jesus, Rhianne R. Argete",
    "abstract": "This study assessed the feasibility of piezoelectric energy harvesting by means of a numerical keypad as a potential viable alternative to conventional energy sources. Piezoelectric ceramic plates were placed underneath the keys of a mechanical keypad to convert the mechanical energy of key-strokes into electrical energy. An alternating current generated from such harvesting was stored in a lithium-ion battery for rectification to direct current and to improve its level. The primary objectives of this research were to characterize the average voltage and current produced during each keystroke and to monitor production over time periods ranging from 10 to 60 minutes. The results showed that each keypress provided a total average of voltage ranging 0.206 V and a standard deviation of 0.190 V, suggesting constant energy generation during the entire exercise. A chi-square test (χ2 = 5.1, p = 0.276) established the statistical validity of these findings in terms of hypothesis testing. However, long periods typing showed no significantly measurable accumulated voltage, indicating possible failure in mechanisms for energy conversion and storage. That could easily have been because of several reasons, such as possible wiring errors, low sensitivity of the boosting system, and intrinsic defects in piezoelectric materials. The development has a promise of low power applications, such as small gadgets or the emergency energy supply, inspiring limited energy generation per keystroke. The study calls for further fine-tuning including better circuitry designs coupled with choice piezoelectric materials and more effective energy storage mechanisms. The current work is based on a new application of piezoelectricity extending the increasing domain of renewably driven energy-global circulation systems. Notwithstanding its limitations, the data analysis stands to show potential for integration of piezoelectric systems in common appliances in tandem with global sustainability drives. Future works must focus on addressing the technical concerns raised in this work to enhance the scalability and feasibility of piezoelectric energy harvesting.",
    "keywords": "piezoelectricity, disc-based piezoelectric sensors, renewable energy production",
    "section": "STEM 2"
  },
  "1W4IG2FYpxo21-bTYutQmLZcR_AuAvqEI": {
    "title": "Prolonged Evaluation of the Automated Electric Rat Trap (AERT) in a Large Agricultural Storage Facility",
    "authors": "Lori Belle R. Gapasangra, Arabhel C. Monserrat, Charles Godwin S. Aguja, Dustin Amiel F. Garcia, James Dale S. Moog, Achilles T. Abary",
    "abstract": "This study investigates the effectiveness of the Automated Electric Rat Trap (AERT) as a humane solution for managing rat populations in agricultural environments. Employing a quasi-experimental pretest-posttest non-equivalent group comparison design, the research compared rat luring and damage to agricultural commodities with and without the AERT over a 10-day period. The study found that the AERT significantly reduced wheat sack damage, with the mean number of damaged sacks decreasing from 0.6842 (without AERT) to 0.3684 (with AERT). A paired t-test revealed a statistically significant difference in wheat sack damage (t = 2.0513, p = 0.0275, one-tailed), indicating the AERT's potential as an effective pest management tool. However, the impact on rat luring was not statistically significant (p = 0.7990). The AERT demonstrated predictable power consumption, with voltage dropping linearly from 11.84V to 10.42V over five days (R² = 0.9721). These findings highlight the importance of humane pest control methods that align with ethical standards and contribute to sustainable agricultural practices, while also emphasizing the need for further research to optimize the AERT's design and functionality.",
    "keywords": "rodent infestation control, automated trapping systems, agricultural pest management, humane pest control, electric pest management, non-chemical pest control",
    "section": "STEM 1"
  },
  "1SrlWKM1jW5q8f781quOx1NctpvL3DWuP": {
    "title": "Push Type Micro Tiller with Detachable Tools",
    "authors": "Honeyzel P. Salay, Andrew Alexson N. Tangilon, Zacharie Elisha L. Ilao, Maria Prisni D. Adefuin, Mieus A.Galleros",
    "abstract": "This study explores the development of a small, manually operated push tiller designed to be a more affordable, lightweight, and environmentally friendly alternative to traditional diesel- or gas-powered tillers. The goal was to create a simple yet effective tool that could help farmers save money while also protecting the soil. Researchers tested two versions of the tiller: one with a basic, streamlined design and another equipped with detachable tools. The focus was on determining which model performed better and was easier to use in real farming conditions. The findings revealed that the simpler tiller, without the extra attachments, was significantly easier to push, allowing farmers to cover more ground efficiently. This made the tilling process faster, less tiring, and more practical for extended use. In contrast, the version with detachable tools, while offering additional functionality, was noticeably heavier and more difficult to maneuver, which limited its efficiency and made long hours of work more exhausting. As a result, farmers using the heavier model couldn’t cover as much land in the same amount of time. These results suggest that a straightforward, lightweight tiller is the better choice, as it reduces strain on the user, saves time, and is more cost-effective—an important factor for farmers with limited financial resources. Additionally, by eliminating the need for fuel-powered machinery, such a tool supports sustainable farming practices and minimizes environmental impact. This study highlights the value of simple, practical agricultural tools in improving farming efficiency while promoting both economic and environmental sustainability.",
    "keywords": "push type micro tiller, cost efficient, detachable tools",
    "section": "STEM 2"
  }
}